In [36]:
import json
import pandas as pd
import numpy as np
import time as tm

start = tm.time()

In [54]:
df = pd.read_json('contacts.json')

In [57]:
df.head(10)

,Id,Email,Phone,Contacts,OrderId
0,0,gkzAbIy@qq.com,,1,
1,1,,329442681752,4,vDDJJcxfLtSfkooPhbYnJdxov
2,2,,9125983679,0,
3,3,mdllpYmE@gmail.com,,0,bHquEnCbbsGLqllwryxPsNOxa
4,4,,300364407,2,
5,5,,840113148,0,
6,6,hESiBgYTxMnj@hotmail.com,,4,
7,7,hqyunTiaXfIjhO@yahoo.com,,1,vxjYZtMUvNhtEBDruzQfjpsmX
8,8,XGUjcSiDpFKWEUCs@qq.com,223604620644,2,
9,9,osIIQgAiZX@hotmail.com,,0,IqewrMXVTJqSsVklWFfOpdRNI

In [62]:
df = df.replace('', np.nan)

In [65]:
df.head(10)

,Id,Email,Phone,Contacts,OrderId
0,0,gkzAbIy@qq.com,NaN,1,NaN
1,1,NaN,329442681752,4,vDDJJcxfLtSfkooPhbYnJdxov
2,2,NaN,9125983679,0,NaN
3,3,mdllpYmE@gmail.com,NaN,0,bHquEnCbbsGLqllwryxPsNOxa
4,4,NaN,300364407,2,NaN
5,5,NaN,840113148,0,NaN
6,6,hESiBgYTxMnj@hotmail.com,NaN,4,NaN
7,7,hqyunTiaXfIjhO@yahoo.com,NaN,1,vxjYZtMUvNhtEBDruzQfjpsmX
8,8,XGUjcSiDpFKWEUCs@qq.com,223604620644,2,NaN
9,9,osIIQgAiZX@hotmail.com,NaN,0,IqewrMXVTJqSsVklWFfOpdRNI

In [77]:
dfE = df[df['Email'].notna()].sort_values(by=['Email'])
dfE

,Id,Email,Phone,Contacts,OrderId
112387,112387,AAAQbNfGbLAeOvw@hotmail.com,NaN,0,icpsNLaMpSDCRaKQIcwADlQHK
470075,470075,AAAQbNfGbLAeOvw@hotmail.com,NaN,4,NaN
338154,338154,AAAgyKTteOjasN@qq.com,NaN,2,NaN
426495,426495,AABZmKeEldvO@gmail.com,NaN,2,NaN
37868,37868,AABneiGcqcz@qq.com,NaN,3,HEbxIabhvRUskctakfvidCcVs
...,...,...,...,...,...
425119,425119,zzyacSRLb@gmail.com,NaN,4,zChTLBmXJoPhBxYMrllaqywlZ
146556,146556,zzylmjkoqfCkTOxi@hotmail.com,NaN,3,qLHBzKUexyPnXKmVopokZbXCW
458030,458030,zzyvKfCcQWPJdShGoItP@hotmail.com,NaN,2,zMWNHuUNdOjfKAXKNyxdKVAox
381064,381064,zzyvKfCcQWPJdShGoItP@hotmail.com,NaN,0,NaN
232950,232950,zzyvegdhAJTFNDRQhMS@hotmail.com,3509005223,0,NaN

In [69]:
dfE = dfE.groupby('Email')['Id'].apply(set)

In [73]:
dfE2 = df[df['Email'].notna()].groupby('Email')['Id'].apply(set)

In [78]:
type(dfE2)

pandas.core.series.Series

In [76]:
len(dfE)

249156

In [6]:
dfP = df[df['phone'].notna()].sort_values(by=['phone'])
dfP

,id,email,phone,contacts,orderid
318092,318092,jfgTlOasz@qq.com,000002957,1,NaN
411745,411745,NaN,00000837565,4,NaN
333273,333273,NaN,00001018140,0,QLVbKUPARSAzURDmkRaLwpEwU
170421,170421,slpvdUMHc@qq.com,0000109887,0,EYcFTihIyfNxMJeEMcVITQJlq
229812,229812,mHEhaAPXNQeafgca@qq.com,0000211995,3,NaN
...,...,...,...,...,...
37583,37583,NaN,999987880646,2,NaN
179194,179194,RysRylVLMYeWPelWvk@gmail.com,99999153118,0,FTiiLHnMAUfFQmKVTbfXVThmx
483731,483731,NaN,9999969553,4,bRsjJdWdGEQBDyzxORpsclyNx
323366,323366,NaN,9999969553,3,NaN
283756,283756,NaN,999997713,3,NaN

In [7]:
dfO = df[df['orderid'].notna()].sort_values(by=['orderid'])
dfO

,id,email,phone,contacts,orderid
445646,445646,NaN,043194750,3,AADcJzTiOYaerdvPPIpHTYWFg
143711,143711,VqskCrEDScUxkjRBS@yahoo.com,NaN,2,AAEDFOpdyZxsvmPcPgmwiELFs
494384,494384,mshoILtrFDiQV@yahoo.com,856277148,0,AAFgjEiKBoQQXfhywaKwGiMlF
442033,442033,NaN,41620151366,3,AAGNMeqoqZVLQYPeKQzxFXjGQ
189835,189835,CAKjixtXUzRbDePM@qq.com,NaN,1,AAHFEboLRkpHKWItnsgAmTbGN
...,...,...,...,...,...
121686,121686,vSSlPjuINOTNkFJ@qq.com,NaN,1,zzuRehsZjVaspgpsRtVgaJCul
123567,123567,NaN,12265894566,3,zzvXLpaILosxjQVAfehImxyqM
157905,157905,NaN,366923956355,0,zzwYYYbmHxGAlqbtuVzIIVQVl
448818,448818,QIqOnxM@yahoo.com,061499216,4,zzxguiahceHZcBcyYDPGqfVsA
185275,185275,NaN,546487760952,0,zzyCSPABaRqpWOAiPLVlFWtoz

In [8]:
ls_ide = list(dfE['id'])
ls_idp = list(dfP['id'])
ls_ido = list(dfO['id'])

ls_e = list(dfE['email'])
ls_en = sorted(list(set(ls_e)))

ls_p = list(dfP['phone'])
ls_pn = sorted(list(set(ls_p)))

ls_o = list(dfO['orderid'])
ls_on = sorted(list(set(ls_o)))

ls_idez = list(zip(ls_ide,ls_e))
ls_idpz = list(zip(ls_idp,ls_p))
ls_idoz = list(zip(ls_ido,ls_o))

In [9]:
print(len(ls_ide))
print(len(ls_idp))
print(len(ls_ido))

print(len(ls_en))
print(len(ls_pn))
print(len(ls_on))

print(len(ls_idez))
print(len(ls_idpz))
print(len(ls_idoz))

348606
245081
243544
249156
190677
189302
348606
245081
243544

In [10]:
dictE2 = {}

num = 0
for i in ls_en:
    temp = []
    for j in range(num, len(ls_idez)):
        if i == ls_idez[j][1]:
            temp.append(ls_idez[j][0])
            dictE2[i] = temp
            num +=1
        else:
            break

In [72]:
dfE

Email
AAAQbNfGbLAeOvw@hotmail.com         {470075, 112387}
AAAgyKTteOjasN@qq.com                       {338154}
AABZmKeEldvO@gmail.com                      {426495}
AABneiGcqcz@qq.com                           {37868}
AABtOIZmdYdKGnidAK@yahoo.com                {137956}
                                          ...
zzyYjbPWM@hotmail.com               {143089, 338473}
zzyacSRLb@gmail.com                         {425119}
zzylmjkoqfCkTOxi@hotmail.com                {146556}
zzyvKfCcQWPJdShGoItP@hotmail.com    {381064, 458030}
zzyvegdhAJTFNDRQhMS@hotmail.com             {232950}
Name: Id, Length: 249156, dtype: object

In [11]:
dictP2 = {}

num = 0
for i in ls_pn:
    temp = []
    for j in range(num, len(ls_idpz)):
        if i == ls_idpz[j][1]:
            temp.append(ls_idpz[j][0])
            dictP2[i] = temp
            num +=1
        else:
            break

In [12]:
dictO2 = {}

num = 0
for i in ls_on:
    temp = []
    for j in range(num, len(ls_idoz)):
        if i == ls_idoz[j][1]:
            temp.append(ls_idoz[j][0])
            dictO2[i] = temp
            num +=1
        else:
            break

In [13]:
# Convert to List

valueE = dictE2.values()
valuelistE = list(valueE)
print(len(valuelistE))

valueP = dictP2.values()
valuelistP = list(valueP)
print(len(valuelistP))

valueO = dictO2.values()
valuelistO = list(valueO)
print(len(valuelistO))

249156
190677
189302

In [14]:
valuelistALL = valuelistP + valuelistO + valuelistE
len(valuelistALL)

629135

In [15]:
# l = [['a','b','c'],['b','d','e'],['k'],['o','p'],['e','f'],['p','a'],['d','g']]
l = valuelistALL

import networkx 
from networkx.algorithms.components.connected import connected_components


def to_graph(l):
    G = networkx.Graph()
    for part in l:
        # each sublist is a bunch of nodes
        G.add_nodes_from(part)
        # it also imlies a number of edges:
        G.add_edges_from(to_edges(part))
    return G

def to_edges(l):
    """ 
        treat `l` as a Graph and returns it's edges 
        to_edges(['a','b','c','d']) -> [(a,b), (b,c),(c,d)]
    """
    it = iter(l)
    last = next(it)

    for current in it:
        yield last, current
        last = current    

G = to_graph(l)
# print(G.connected_components())

In [16]:
main_idx = []

for i in connected_components(G):
    main_idx.append(list(i))

In [17]:
x = 0

for i in main_idx:
    for j in i:
        x += 1

x

500000

In [18]:
ls_ct = list(df['contacts'])

In [19]:
sum_ct = []

for row in main_idx:
    num = 0
    for j in row:
        num += ls_ct[j]
    sum_ct.append(num)

In [20]:
len(sum_ct)

291904

In [21]:
idx_str = []

for row in main_idx:
    row = sorted(row)
    format = [str(j) for j in row]
    format = '-'.join(format)
    idx_str.append(format)

In [22]:
len(idx_str)

291904

In [23]:
ori_index = list(df['id'])

In [24]:
combi_lst = list(zip(main_idx, idx_str, sum_ct))

In [25]:
# CARA 2
new_ct = []
new_str = []
explode = []

for row in combi_lst:
    for j in row[0]:
        explode.append([j, row[1], row[2]])

In [26]:
combi_lst[0]

([286504, 92300, 304154, 318092], '92300-286504-304154-318092', 7)

In [27]:
explode = sorted(explode, key = lambda x: x[0])

In [28]:
df_rslt = pd.DataFrame(explode, columns=['id','id group', 'sum contacts'])
df_rslt

            id                                  id group  sum contacts
0            0                                         0             1
1            1  1-2458-98519-115061-140081-165605-476346            12
2            2                    2-159312-322639-348955             4
3            3                                         3             0
4            4                                         4             2
...        ...                                       ...           ...
499995  499995                                    499995             2
499996  499996                                    499996             4
499997  499997                                    499997             2
499998  499998                             121111-499998             5
499999  499999                                    499999             0

[500000 rows x 3 columns]

In [29]:
df_total = pd.merge(df,df_rslt,on='id')
df_total.head(10)

,id,email,phone,contacts,orderid,id group,sum contacts
0,0,gkzAbIy@qq.com,NaN,1,NaN,0,1
1,1,NaN,329442681752,4,vDDJJcxfLtSfkooPhbYnJdxov,1-2458-98519-115061-140081-165605-476346,12
2,2,NaN,9125983679,0,NaN,2-159312-322639-348955,4
3,3,mdllpYmE@gmail.com,NaN,0,bHquEnCbbsGLqllwryxPsNOxa,3,0
4,4,NaN,300364407,2,NaN,4,2
5,5,NaN,840113148,0,NaN,5-50-212533-215197-226720-383605-404324-458692...,15
6,6,hESiBgYTxMnj@hotmail.com,NaN,4,NaN,6-38-32871-142067-236367,13
7,7,hqyunTiaXfIjhO@yahoo.com,NaN,1,vxjYZtMUvNhtEBDruzQfjpsmX,7,1
8,8,XGUjcSiDpFKWEUCs@qq.com,223604620644,2,NaN,8-183160-406623,5
9,9,osIIQgAiZX@hotmail.com,NaN,0,IqewrMXVTJqSsVklWFfOpdRNI,9-13-16708-33415-343161-417916-468927-484896,8

In [30]:
df_total

,id,email,phone,contacts,orderid,id group,sum contacts
0,0,gkzAbIy@qq.com,NaN,1,NaN,0,1
1,1,NaN,329442681752,4,vDDJJcxfLtSfkooPhbYnJdxov,1-2458-98519-115061-140081-165605-476346,12
2,2,NaN,9125983679,0,NaN,2-159312-322639-348955,4
3,3,mdllpYmE@gmail.com,NaN,0,bHquEnCbbsGLqllwryxPsNOxa,3,0
4,4,NaN,300364407,2,NaN,4,2
...,...,...,...,...,...,...,...
499995,499995,NaN,10072395382,2,whJlUOGNqjxCRzmIRdURQvlNv,499995,2
499996,499996,NaN,571709661031,4,JqIXOONvrwvJxZqNxCYHqnrKS,499996,4
499997,499997,NaN,4541459979,2,beXCZSzcHaBwAYoDcpQqjuAFO,499997,2
499998,499998,RzSDsyH@hotmail.com,98947185431,1,ehjeFACGiwrERQxbziMxwOWku,121111-499998,5
499999,499999,NaN,880053388839,0,JibSBRgzYdfzkzbTuGUXrcvDX,499999,0

In [31]:
end = tm.time()

print("Time Elapsed: ")
print(end - start)

Time Elapsed:
14.217277526855469